CSI API ETABS v1

# cLoadCasesModalEigen Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseModalEigen ModalEigen { get; }

    ReadOnly Property ModalEigen As cCaseModalEigen
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseModalEigen

    value = instance.ModalEigen

    property cCaseModalEigen^ ModalEigen {
    	cCaseModalEigen^ get ();
    }

    abstract ModalEigen : cCaseModalEigen with get

#### Property Value

Type: cCaseModalEigen

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com